# >>>(Вопрос 1.) Напишите код для ввода двух чисел. Вычислите их разницу.
# num1 = int(input('Введите число1: '))
# num2 = int(input('Введите число2: '))
# print(num1, '-', num2, '=', num1-num2)

# >>>(Вопрос 2.) Вычислите остаток деления 36 на 5
# print('Остаток от деления: ', 36 % 5)

# >>>(Вопрос 3.) Напишите проверку на то, является ли строка палиндромом.
# >>>Палиндром — это слово или фраза, которые одинаково читаются слева направо и справа налево.
# word1 = input('input a word: ')
# if word1 == word1[::-1]:
#     print('Palindrom')
# else:
#     print('Not Palendrom')

# >>>(Вопрос 4.) Дана строка “I love Java”. Выведите первые два слова и I love Java”.
# >>>Выведите первые два слова и добавьте к ним Python.
# text = 'I Love Java'
# print(text.replace('Java', ''))
# print(text)
# print(text.replace('Java', ''))
# print(text.replace('Java', 'Python'))

# >>>(Вопрос 5.) Напишите код для ввода текста.
# >>>Введите свое имя и выведите его в терминал 10 раз.
# name1 = input('Введите свое имя: ')
# for x in range(10):
#     print(x+1, name1)

# >>>(Вопрос 6) Напишите код для ввода текста. Выведите все буквы в обратном порядке.
#word = input('input a word: ')
#print(word, '<>', word[::-1])

# >>>(Вопрос 7) Не понятный вопрос.

# >>>(Вопрос 8) Напишите программу для получения первых 2 и последних 2 символов в строке.
#    Если строка содержит 2 символа, выведите их 2 раза.
#    Если в строке 2 символа, выведите саму строку.
#    Если строка содержит меньше 2 символов, то выведите сообщение «Error».Error».
# slovo = input('введите слово: ')
# s2 = slovo[:2]
# f2 = slovo[-2:]
# print(s2 + f2)

# >>>(Вопрос 9.) Напишите код для ввода числа. Выведите его предыдущее и следующее числа.
# >>>(Например пользователь ввел 5. Вывод должен быть: 4, 6)
# x = int(input('Введите число: '))
# print(x-1, x, x+1)

# >>>(Вопрос 10.) Пользователь вводит два числа. Сравните их и выведите результат.
# num1 = int(input('Введите число1: '))
# num2 = int(input('Введите число2: '))
# if num1 > num2:
#     print(num1, '>', num2)
# elif num1 < num2:
#     print(num1, '<', num2)
# else:
#     print(num1, '=', num2)

# >>>(Вопрос 11.) Пользователь вводит число. Проверьте отрицательное оно или положительное.
#    выведите результаты (0 не является ни положительным, ни отрицательным)
# x = int(input('Введите число: '))
# if x > 0:
#     print(x, 'положительное число')
# elif x <0:
#     print(x, 'отрицательное число')
# else:
#     print('Введите число кроме 0 ')

## >>>> 11/11 <<<<<






